app/views/prototypes/show.html.erb

SELECT `comments`.* FROM `comments` WHERE `comments`.`prototype_id` = 1
---
            <li class="comments_list">
              <% @prototype.comments.each do |comment| %>