app/controllers/comments_controller.rb

INSERT INTO `comments` (`text`, `created_at`, `updated_at`, `user_id`, `prototype_id`) VALUES ('x', '2021-03-18 09:06:57.055208', '2021-03-18 09:06:57.055208', 1, 1)
---
  def create
    @comment = Comment.new(comment_params)
    if @comment.save