app/controllers/prototypes_controller.rb

  def index
    @prototypes = Prototype.all
---
SELECT `prototypes`.* FROM `prototypes`

  def show
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 2 LIMIT 1

  def create
    @prototype = Prototype.new(prototype_params)
    if @prototype.save
---
INSERT INTO `prototypes` (`title`, `catch_copy`, `concept`, `user_id`, `created_at`, `updated_at`) VALUES ('プロトタイプ3', 'っだ', 'おど', 2, '2021-03-19 04:04:29.080335', '2021-03-19 04:04:29.080335')

   def edit
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 10 LIMIT 1

   def update
    if @prototype.update
---
UPDATE `prototypes` SET `prototypes`.`updated_at` = '2021-03-19 04:04:29.092582' WHERE `prototypes`.`id` = 10

   def destroy
    if @prototype.destroy
---
DELETE FROM `prototypes` WHERE `prototypes`.`id` = 6

  def set_prototype
    @prototype = Prototype.find(params[:id])
---
SELECT `prototypes`.* FROM `prototypes` WHERE `prototypes`.`id` = 5 LIMIT 1